[
	{
		"title": "Amedisys Divests Locations in Advance of Optum Deal",
		"link": "https://hospicenews.com/category/finance/",
		"description": "Amedisys has divested several home health locations to VitalCaring. The deal includes Unitedhealth Group care centers. Financial terms remain undisclosed. \n..."
	},
	{
		"title": "Hospices’ Compliance Outlook a ‘Balancing Act’",
		"link": "https://hospicenews.com/category/regulation/",
		"description": "The Supreme Court's ruling on the Chevron Doctrine could affect how CMS regulates hospice providers. \n..."
	},
	{
		"title": "Hospices’ 2024 Public Policy Priorities",
		"link": "https://hospicenews.com/category/featured/",
		"description": "Amedisys has sold a number of home health locations to VitalCaring, including some UnitedHealth Group care centers. The terms of the deal were not disclosed...."
	},
	{
		"title": "How The Supreme Court’s Chevron Decision Could Help Stop Home Health Cuts",
		"link": "https://homehealthcarenews.com/category/home-health-care/",
		"description": "Amedisys is selling some of its home health locations to VitalCaring to address antitrust concerns ahead of its acquisition by UnitedHealth Group. \n..."
	},
	{
		"title": "End-of-Life Care Delivery ‘Ripe for Reform’ in Rep. Blumenauer’s Hospice CARE Act",
		"link": "https://hospicenews.com/category/regulation/",
		"description": "The Supreme Court's ruling on the Chevron Doctrine may impact CMS's ability to regulate health care providers, including hospices. \n..."
	},
	{
		"title": "Supreme Court Ruling Could Complicate CMS Efforts to Regulate Hospices",
		"link": "https://hospicenews.com/category/regulation/",
		"description": "The Supreme Court's decision on the Chevron Doctrine could make it harder for CMS to regulate healthcare providers. \n..."
	},
	{
		"title": "The AIDS Epidemic’s Lasting Impact on Hospice Care for LGBTQ+ Populations",
		"link": "https://hospicenews.com/category/operations/diversity-and-inclusion/",
		"description": "This article discusses the lasting impact of the AIDS epidemic on hospice care for LGBTQ+ individuals, highlighting the need for improved care and support within..."
	},
	{
		"title": "Elara Caring Acquires Caregivers Home Health",
		"link": "https://hospicenews.com/category/ma/",
		"description": "Elara Caring expands its presence in Kansas and Iowa through the acquisition of Caregivers Home Health. \n..."
	},
	{
		"title": "Home Health Lobby Slams Proposed 2025 Home Health Pay Rule",
		"link": "https://pqhh.org/article/home-health-lobby-slams-proposed-2025-home-health-pay-rule/",
		"description": "The article discusses the home health lobby's response to proposed Medicare cuts for the 2025 fiscal year. \n..."
	},
	{
		"title": "Medicare Seeks $280 Million Pay Cut for Home Health Agencies",
		"link": "https://pqhh.org/article/medicare-seeks-280-million-pay-cut-for-home-health-agencies/",
		"description": "The Biden administration proposes a 1.7% cut in Medicare payments to home health agencies, totaling $280 million in 2025. \n..."
	},
	{
		"title": "CMS proposes -1.7 percent Medicare home health payment decrease for 2025",
		"link": "https://pqhh.org/article/cms-proposes-1-7-percent-medicare-home-health-payment-decrease-for-2025/",
		"description": "The Centers for Medicare & Medicaid Services proposes a decrease in Medicare payments for home health agencies for 2025. \n..."
	},
	{
		"title": "CMS Proposes Over 4% Cut To Home Health Medicare Payments In 2025",
		"link": "https://pqhh.org/article/cms-proposes-over-4-cut-to-home-health-medicare-payments-in-2025/",
		"description": "The Centers for Medicare & Medicaid Services (CMS) has proposed a cut to home health Medicare payments for 2025. \n..."
	},
	{
		"title": "CMS proposes 1.7% Medicare cut for home health providers",
		"link": "https://pqhh.org/article/cms-proposes-1-7-medicare-cut-for-home-health-providers/",
		"description": "The Centers for Medicare & Medicaid Services proposes a 1.7% Medicare pay cut for home health agencies in 2025. \n..."
	},
	{
		"title": "Home Health Leaders: More Home Health Cuts in 2025 Further Undermine Patient Access to Care",
		"link": "https://pqhh.org/article/home-health-leaders-more-home-health-cuts-in-2025-further-undermine-patient-access-to-care/",
		"description": "The Partnership for Quality Home Healthcare warns that CMS's proposed Medicare home health cuts will hurt patients and undermine quality care. \n..."
	},
	{
		"title": "GAO Report Finds Millions of Seniors Are Not Getting the Homecare They Need",
		"link": "https://www.homecaremag.com/news/gao-report-finds-millions-seniors-are-not-getting-homecare-they-need",
		"description": "Four out of five seniors who needed a home delivered or congregate meal in 2021 did not receive one..."
	},
	{
		"title": "VNS Health Settles Lawsuit For Billing For Services They Failed to Provide, Document",
		"link": "https://www.homecaremag.com/news/vns-health-settles-lawsuit-billing-services-they-failed-provide-document",
		"description": "Defendants will pay nearly $1M & admit they sought & received payments for assertive community treatment services they failed to provide or document..."
	},
	{
		"title": "CMS Proposes 4% Payment Cut for Home Health",
		"link": "https://www.homecaremag.com/news/cms-proposes-4-payment-cut-home-health",
		"description": "Advocates say move would continue to hurt patients, providers and limit access to care in the..."
	},
	{
		"title": "Right at Home Looks to Expand in Midland, Texas",
		"link": "https://www.homecaremag.com/news/right-home-looks-expand-midland-texas",
		"description": "Right at Home offers investment opportunity backed by decades of experience & a 700-unit system for visionaries in the community of Midland..."
	},
	{
		"title": "David Chandler Named AAHomecare VP of Payer Relations",
		"link": "https://www.homecaremag.com/news/david-chandler-named-aahomecare-vp-payer-relations",
		"description": "Chandler has five-plus years with the association and experience with multiple state associations..."
	},
	{
		"title": "Compass Health Becomes Diamond Level Sponsor of AAHomecare",
		"link": "https://www.homecaremag.com/news/compass-health-becomes-diamond-level-sponsor-aahomecare",
		"description": "Compass Health has been a supporter of AAHomecare for the past seven years..."
	},
	{
		"title": "NAHC, NHPCO Release Signing of Affiliation Agreement Statement",
		"link": "https://www.homecaremag.com/news/nahc-nhpco-release-signing-affiliation-agreement-statement",
		"description": "NAHC, NHPCO are the two largest organizations representing & advocating for providers of care in the home..."
	},
	{
		"title": "Gilgal Medical Supplies Expands into Florida Cities to Address the Absence of DME Providers",
		"link": "https://www.homecaremag.com/news/gilgal-medical-supplies-expands-florida-cities-address-absence-dme-providers",
		"description": "The expansion aims to address the need for DME providers in the region..."
	},
	{
		"title": "Element Care PACE Opens New Site in Massachusetts",
		"link": "https://www.homecaremag.com/news/element-care-pace-opens-new-site-massachusetts",
		"description": "Massachusetts-based nonprofit expands PACE program offerings to underserved adults over 55 in Lynn and surrounding areas..."
	},
	{
		"title": "Axxess, SimiTree Partner to Launch Platforms to Empower Home Health, Hospice Growth",
		"link": "https://www.homecaremag.com/news/axxess-simitree-partner-launch-platforms-empower-home-health-hospice-growth",
		"description": "Key market, referral & utilization data available for streamlined decision-making..."
	},
	{
		"title": "AccentCare Names Chris Mayne President of Home Health",
		"link": "https://www.homecaremag.com/news/accentcare-names-chris-mayne-president-home-health",
		"description": "Mayne joins AccentCare from Optum where he was most recently president of its California care delivery unit..."
	},
	{
		"title": "Nymbl Systems Launches Single-Page Patient Intake to Transform O&P, CRT, HME Efficiency",
		"link": "https://www.homecaremag.com/news/nymbl-systems-launches-single-page-patient-intake-transform-op-crt-hme-efficiency",
		"description": "O&P, CRT & HME providers experience an average of 20% efficiency gains with more streamlined & automated patient intake workflow..."
	},
	{
		"title": "Axxess and SimiTree Partner to Launch Platforms to Empower Growth",
		"link": "https://www.homecaremag.com/news/axxess-and-simitree-partner-launch-platforms-empower-growth",
		"description": "Key market, referral & utilization data available for streamlined decision-making..."
	},
	{
		"title": "Canopy Expands Real-Time Wearable Safety from Hospitals to Home Health",
		"link": "https://www.homecaremag.com/news/canopy-expands-real-time-wearable-safety-hospitals-home-health",
		"description": "Leading health systems expand staff safety initiatives by deploying Canopy's real-time support network beyond hospital walls..."
	},
	{
		"title": "Patient Satisfaction Surveys Are Much More Than a CMS Requirement",
		"link": "https://www.homecaremag.com/news/webinars/patient-satisfaction-surveys-are-much-more-cms-requirement",
		"description": "Patient satisfaction surveys are critical to learning how to improve your services and..."
	},
	{
		"title": "Successfully Implementing an Outsourced Staffing Solution",
		"link": "https://www.homecaremag.com/news/webinars/successfully-implementing-outsourced-staffing-solution",
		"description": "Learn from staffing providers and utilizers what it takes to successfully implement a staffing outsource..."
	}
]
